# Here are tasks from course on Stepic completed at Java.  
**1 TASK.**  
Вводится целое число. Необходимо вывести на экран Hello World!﻿  
Sample Input: 5  
Sample Output: Hello World!  
**2 TASK.**  
Выведите на экран фразу "Программировать - это легко! " 3 раза, каждый раз с новой строки.﻿  
Sample Input:  
Sample Output:  
Программировать - это легко!  
Программировать - это легко!  
Программировать - это легко!  
**3 TASK.**  
Выведите на экран фразу "Программировать - это легко! " 5 раз,  каждый раз через пробел.﻿  
Sample Input:  
Sample Output:  
Программировать - это легко! Программировать - это легко! Программировать - это легко! Программировать - это легко! Программировать - это легко!  
**4 TASK.**  
Введите 3 числа. И выведите их через пробел в обратном порядке.  
Sample Input: 1 2 3  
Sample Output: 3 2 1  
**5 TASK.**  
Программа получает на вход два целых числа. Числа не превышают 1000000000.  
Программа должна вывести одно целое число - сумму двух чисел.  
Sample Input: 8 11  
Sample Output: 19  
**6 TASK.**  
Дано слово состоящее из букв в любом регистре. Необходимо вывести на экран таблицу в соответствии с примером:  
Пусть слово = "abcde", тогда таблица должна быть вот такой -  
a b c d e  
b 0 0 0 d  
c 0 0 0 c  
d 0 0 0 b  
e d c b a  
Где пустое пространство заполняется нулями!  
Расстояние между буквами на выводе - 1 пробел  
Sample Input 1:  
abcde  
Sample Output 1:  
a b c d e   
b 0 0 0 d   
c 0 0 0 c   
d 0 0 0 b   
e d c b a   
Sample Input 2:  
recursion  
Sample Output 2:  
r e c u r s i o n   
e 0 0 0 0 0 0 0 o   
c 0 0 0 0 0 0 0 i   
u 0 0 0 0 0 0 0 s   
r 0 0 0 0 0 0 0 r   
s 0 0 0 0 0 0 0 u   
i 0 0 0 0 0 0 0 c   
o 0 0 0 0 0 0 0 e   
n o i s r u c e r  
**7 TASK.**  
Вводится буква, необходимо вывести ее код.  
Sample Input 1:  
a  
Sample Output 1:  
97  
**8 TASK.**  
Вводятся две буквы необходимо вывести сумму кодов этих букв  
Sample Input:  
a b  
Sample Output:  
195  
**9 TASK.**  
Вводятся два числа с одинарной точностью. Вывести результат их деления с точностью до 2 знака.  
В Си это выглядело бы так - printf("%0.2f", val)  
Sample Input:  
1 2  
Sample Output:  
0.50  
**10 TASK.**  
Необходимо вывести остаток от деления первого числа на второе  
Sample Input:  
55656567464 674764  
Sample Output:  
8452  
